---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.DifferentOffsets
source: html/d3349e9a-7d07-f1ed-d58c-18c3cabf68b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.DifferentOffsets Property

Adjacent slope-defining lines must have identical eave heights; the highlighted lines do not. You can use the Align Eaves tool to have the eaves aligned for you.

## Syntax (C#)
```csharp
public static FailureDefinitionId DifferentOffsets { get; }
```